
# # 1
# # 준비물 1: 내용이 있는 문자열
# item1 = '지도'
# # 준비물 2: 내용이 있는 문자열
# item2 = '나침반'

# result = item1 and item2

# print(f'최종적으로 챙긴 물건: {result}')

# # 내 예상: 나침반일 것이다!!
# # 나침반이 맞음!!


# # 2
# # 준비물 1: 내용이 있는 문자열
# item1 = '지도'
# # 준비물 2: 내용이 없는 빈 문자열
# item2 = ''

# result = item1 and item2

# print(f'최종적으로 챙긴 물건: {result}')

# # 내 예상: 빈 문자열일 것이다!! 거짓이니까!!
# # ㄴ 맞음!!


# 3
# 준비물 1: 내용이 없는 빈 문자열
item1 = ''
# 준비물 2: 
item2 = '나침반'

result = item1 and item2

print(f'최종적으로 챙긴 물건: {result}')

# 내 예상: 빈 문자열일 것이다!! 거짓이니까!!
# ㄴ 맞음!!

